// # 引用与借用

// & 表示引用, &mut s 表示可变引用
// 允许你使用值但不获取其所有权
// * 解引用，与使用 & 引用相反的操作


// 将创建一个引用的行为称为 借用（borrowing）
// 借用是 Rust 中的一个核心概念，它确保了内存安全和并发安全
// 借用规则
// 1. 同一个时间只能有一个对某一特定数据的可变引用，避免数据竞争
// 2. 同一个时间，要么 只能有一个可变引用，要么 只能有多个不可变引用。
// 3. 引用必须在使用前初始化


// 数据竞争
// 数据竞争是指在多个线程或进程同时访问同一数据时，可能会导致不一致的结果
// 例如，一个线程可能正在修改数据，而另一个线程正在读取该数据，导致不一致的结果
// Rust 通过借用规则来防止数据竞争，确保了内存安全和并发安全

// 造成数据竞争的行为（需要同时发生）
// 两个或更多指针同时访问同一数据。
// 至少有一个指针被用来写入数据。
// 没有同步数据访问的机制。



// 悬垂引用
// 悬垂引用是指在数据被释放后，引用仍然指向该数据
// 例如，一个函数返回一个对局部变量的引用，而局部变量被销毁了
// 这会导致悬垂引用，因为局部变量的内存已被释放，引用指向的内存已被重用
// Rust 通过借用规则来防止悬垂引用，确保了内存安全和并发安全
// 造成悬垂引用的行为（需要同时发生）
// 一个引用指向的数据被释放了，而引用仍然指向该数据。
// 另一个引用指向的数据被重用了，而引用仍然指向该数据。



fn main() {
    let s1 = String::from("hello");

    // &s1 语法让我们创建一个 指向 值 s1 的引用
    let len = calculate_length(&s1);
    println!("The length of '{}' is {}.", s1, len);


    let mut s2 = String::from("hello");
    change(&mut s2);
    println!("s2 = {}", s2);
}


fn calculate_length(s: &String) -> usize { // s 是对 String 的引用
    s.len()
}

fn change(some_string: &mut String) {
    some_string.push_str(", world");
}


fn dangle() -> &String { // dangle 返回一个字符串的引用

    let s = String::from("hello"); // s 是一个新字符串

    &s // 返回字符串 s 的引用
} // 这里 s 离开作用域并被丢弃。其内存被释放。
  // 危险！返回一个对悬垂内存的引用。